###############################################################################
# Created by write_sdc
# Wed May  5 16:30:07 2021
###############################################################################
current_design my_design
###############################################################################
# Units
###############################################################################
# set_units -time ps
# Timing Constraints
###############################################################################
# create_clock -name core_clock -period 0.001 -waveform {0.0000 0.0005} [get_ports {clk}]
###############################################################################
# Environment
###############################################################################
###############################################################################
# Design Rules
###############################################################################